//=============================================================================
//
// メイン処理 [main.h]
// Author : 
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "d3dx9.h"
#include "xaudio2.h"	//サウンド再生に必要


#pragma	comment(lib,"dinput8.lib")
#pragma comment(lib,"winmm.lib")

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")
#pragma comment(lib, "dxguid.lib")

//キーボード入力処理
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH (1280)											//ゲーム画面の幅
#define SCREEN_HEIGHT (720)											//ゲーム画面の高さ
#define WIDTH_HALF		(SCREEN_WIDTH/2)
#define HEIGHT_HALF		(SCREEN_HEIGHT/2)

#define CENTER_POS		(D3DXVECTOR3(WIDTH_HALF,HEIGHT_HALF,0.0f))
#define NUM_VERTEX (4)												//頂点数
#define NUM_POLYGON (2)												//ポリゴン数(プリミティブ)

#define FVF_VERTEX_2D (D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1)	//頂点フォーマット(描画に必要なデータ)の種類
//-------------------------------------------------------------------------------
// 前方宣言
//-------------------------------------------------------------------------------
class CScene;

//-------------------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------------------
int GetFPS(void);		// デバイスの取得(FPS)

#endif